Revit 2027 API
UV(Double, Double) Constructor
Creates a UV with the supplied coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV(
	double u,
	double v
)
Public Sub New (
	u As Double,
	v As Double
)
public:
UV(
	double u,
	double v
)
new :
        u : float *
        v : float -> UV
Parameters
u Double
The first coordinate.
v Double
The second coordinate.
Exceptions
Exception | Condition
ArgumentException |  Thrown when setting an infinite number to the U or V property.
See Also
Reference
UV Class
UV Overload
Autodesk.Revit.DB Namespace